ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32F3xx/stm32f373xc.h
/******************  Bit definition for SDADC_CONF2R register  ****************/
#define SDADC_CONF2R_OFFSET2_Pos      (0U)                                     
#define SDADC_CONF2R_OFFSET2_Msk      (0xFFFU << SDADC_CONF2R_OFFSET2_Pos)     /*!< 0x00000FFF */
#define SDADC_CONF2R_OFFSET2          SDADC_CONF2R_OFFSET2_Msk                 /*!< 12-bit calibration offset for configuration 2 */
#define SDADC_CONF2R_GAIN2_Pos        (20U)                                    
#define SDADC_CONF2R_GAIN2_Msk        (0x7U << SDADC_CONF2R_GAIN2_Pos)         /*!< 0x00700000 */
#define SDADC_CONF2R_GAIN2            SDADC_CONF2R_GAIN2_Msk                   /*!< Gain setting for configuration 2 */
#define SDADC_CONF2R_GAIN2_0          (0x1U << SDADC_CONF2R_GAIN2_Pos)         /*!< 0x00100000 */
#define SDADC_CONF2R_GAIN2_1          (0x2U << SDADC_CONF2R_GAIN2_Pos)         /*!< 0x00200000 */
#define SDADC_CONF2R_GAIN2_2          (0x4U << SDADC_CONF2R_GAIN2_Pos)         /*!< 0x00400000 */
#define SDADC_CONF2R_SE2_Pos          (26U)                                    
#define SDADC_CONF2R_SE2_Msk          (0x3U << SDADC_CONF2R_SE2_Pos)           /*!< 0x0C000000 */
#define SDADC_CONF2R_SE2              SDADC_CONF2R_SE2_Msk                     /*!< Single ended mode for configuration 2 */
#define SDADC_CONF2R_SE2_0            (0x1U << SDADC_CONF2R_SE2_Pos)           /*!< 0x04000000 */
#define SDADC_CONF2R_SE2_1            (0x2U << SDADC_CONF2R_SE2_Pos)           /*!< 0x08000000 */
#define SDADC_CONF2R_COMMON2_Pos      (30U)                                    
#define SDADC_CONF2R_COMMON2_Msk      (0x3U << SDADC_CONF2R_COMMON2_Pos)       /*!< 0xC0000000 */
#define SDADC_CONF2R_COMMON2          SDADC_CONF2R_COMMON2_Msk                 /*!< Common mode for configuration 2 */
#define SDADC_CONF2R_COMMON2_0        (0x1U << SDADC_CONF2R_COMMON2_Pos)       /*!< 0x40000000 */
#define SDADC_CONF2R_COMMON2_1        (0x2U << SDADC_CONF2R_COMMON2_Pos)       /*!< 0x80000000 */

/*****************  Bit definition for SDADC_CONFCHR1 register  ***************/
#define SDADC_CONFCHR1_CONFCH0_Pos    (0U)                                     
#define SDADC_CONFCHR1_CONFCH0_Msk    (0x3U << SDADC_CONFCHR1_CONFCH0_Pos)     /*!< 0x00000003 */
#define SDADC_CONFCHR1_CONFCH0        SDADC_CONFCHR1_CONFCH0_Msk               /*!< Channel 0 configuration */
#define SDADC_CONFCHR1_CONFCH1_Pos    (4U)                                     
#define SDADC_CONFCHR1_CONFCH1_Msk    (0x3U << SDADC_CONFCHR1_CONFCH1_Pos)     /*!< 0x00000030 */
#define SDADC_CONFCHR1_CONFCH1        SDADC_CONFCHR1_CONFCH1_Msk               /*!< Channel 1 configuration */
#define SDADC_CONFCHR1_CONFCH2_Pos    (8U)                                     
#define SDADC_CONFCHR1_CONFCH2_Msk    (0x3U << SDADC_CONFCHR1_CONFCH2_Pos)     /*!< 0x00000300 */
#define SDADC_CONFCHR1_CONFCH2        SDADC_CONFCHR1_CONFCH2_Msk               /*!< Channel 2 configuration */
#define SDADC_CONFCHR1_CONFCH3_Pos    (12U)                                    
#define SDADC_CONFCHR1_CONFCH3_Msk    (0x3U << SDADC_CONFCHR1_CONFCH3_Pos)     /*!< 0x00003000 */
#define SDADC_CONFCHR1_CONFCH3        SDADC_CONFCHR1_CONFCH3_Msk               /*!< Channel 3 configuration */
#define SDADC_CONFCHR1_CONFCH4_Pos    (16U)                                    
#define SDADC_CONFCHR1_CONFCH4_Msk    (0x3U << SDADC_CONFCHR1_CONFCH4_Pos)     /*!< 0x00030000 */
#define SDADC_CONFCHR1_CONFCH4        SDADC_CONFCHR1_CONFCH4_Msk               /*!< Channel 4 configuration */
#define SDADC_CONFCHR1_CONFCH5_Pos    (20U)                                    
#define SDADC_CONFCHR1_CONFCH5_Msk    (0x3U << SDADC_CONFCHR1_CONFCH5_Pos)     /*!< 0x00300000 */
#define SDADC_CONFCHR1_CONFCH5        SDADC_CONFCHR1_CONFCH5_Msk               /*!< Channel 5 configuration */
#define SDADC_CONFCHR1_CONFCH6_Pos    (24U)                                    
#define SDADC_CONFCHR1_CONFCH6_Msk    (0x3U << SDADC_CONFCHR1_CONFCH6_Pos)     /*!< 0x03000000 */
#define SDADC_CONFCHR1_CONFCH6        SDADC_CONFCHR1_CONFCH6_Msk               /*!< Channel 6 configuration */
#define SDADC_CONFCHR1_CONFCH7_Pos    (28U)                                    
#define SDADC_CONFCHR1_CONFCH7_Msk    (0x3U << SDADC_CONFCHR1_CONFCH7_Pos)     /*!< 0x30000000 */
#define SDADC_CONFCHR1_CONFCH7        SDADC_CONFCHR1_CONFCH7_Msk               /*!< Channel 7 configuration */

/*****************  Bit definition for SDADC_CONFCHR2 register  ***************/
#define SDADC_CONFCHR2_CONFCH8_Pos    (0U)                                     
#define SDADC_CONFCHR2_CONFCH8_Msk    (0x3U << SDADC_CONFCHR2_CONFCH8_Pos)     /*!< 0x00000003 */
#define SDADC_CONFCHR2_CONFCH8        SDADC_CONFCHR2_CONFCH8_Msk               /*!< Channel 8 configuration */

/*****************  Bit definition for SDADC_JDATAR register  ***************/
#define SDADC_JDATAR_JDATA_Pos        (0U)                                     
#define SDADC_JDATAR_JDATA_Msk        (0xFFFFU << SDADC_JDATAR_JDATA_Pos)      /*!< 0x0000FFFF */
#define SDADC_JDATAR_JDATA            SDADC_JDATAR_JDATA_Msk                   /*!< Injected group conversion data */
#define SDADC_JDATAR_JDATACH_Pos      (24U)                                    
#define SDADC_JDATAR_JDATACH_Msk      (0xFU << SDADC_JDATAR_JDATACH_Pos)       /*!< 0x0F000000 */
#define SDADC_JDATAR_JDATACH          SDADC_JDATAR_JDATACH_Msk                 /*!< Injected channel most recently converted */
#define SDADC_JDATAR_JDATACH_0        (0x1U << SDADC_JDATAR_JDATACH_Pos)       /*!< 0x01000000 */
#define SDADC_JDATAR_JDATACH_1        (0x2U << SDADC_JDATAR_JDATACH_Pos)       /*!< 0x02000000 */
#define SDADC_JDATAR_JDATACH_2        (0x4U << SDADC_JDATAR_JDATACH_Pos)       /*!< 0x04000000 */
#define SDADC_JDATAR_JDATACH_3        (0x8U << SDADC_JDATAR_JDATACH_Pos)       /*!< 0x08000000 */

/*****************  Bit definition for SDADC_RDATAR register  ***************/
#define SDADC_RDATAR_RDATA_Pos        (0U)                                     
#define SDADC_RDATAR_RDATA_Msk        (0xFFFFU << SDADC_RDATAR_RDATA_Pos)      /*!< 0x0000FFFF */
#define SDADC_RDATAR_RDATA            SDADC_RDATAR_RDATA_Msk                   /*!< Injected group conversion data */

/*****************  Bit definition for SDADC_JDATA12R register  ***************/
#define SDADC_JDATA12R_JDATA2_Pos     (16U)                                    
#define SDADC_JDATA12R_JDATA2_Msk     (0xFFFFU << SDADC_JDATA12R_JDATA2_Pos)   /*!< 0xFFFF0000 */
#define SDADC_JDATA12R_JDATA2         SDADC_JDATA12R_JDATA2_Msk                /*!< Injected group conversion data for SDADC2 */
#define SDADC_JDATA12R_JDATA1_Pos     (0U)                                     
#define SDADC_JDATA12R_JDATA1_Msk     (0xFFFFU << SDADC_JDATA12R_JDATA1_Pos)   /*!< 0x0000FFFF */
#define SDADC_JDATA12R_JDATA1         SDADC_JDATA12R_JDATA1_Msk                /*!< Injected group conversion data for SDADC1 */

/*****************  Bit definition for SDADC_RDATA12R register  ***************/
#define SDADC_RDATA12R_RDATA2_Pos     (16U)                                    
#define SDADC_RDATA12R_RDATA2_Msk     (0xFFFFU << SDADC_RDATA12R_RDATA2_Pos)   /*!< 0xFFFF0000 */
#define SDADC_RDATA12R_RDATA2         SDADC_RDATA12R_RDATA2_Msk                /*!< Regular conversion data for SDADC2 */
#define SDADC_RDATA12R_RDATA1_Pos     (0U)                                     
#define SDADC_RDATA12R_RDATA1_Msk     (0xFFFFU << SDADC_RDATA12R_RDATA1_Pos)   /*!< 0x0000FFFF */
#define SDADC_RDATA12R_RDATA1         SDADC_RDATA12R_RDATA1_Msk                /*!< Regular conversion data for SDADC1 */

/*****************  Bit definition for SDADC_JDATA13R register  ***************/
#define SDADC_JDATA13R_JDATA3_Pos     (16U)                                    
#define SDADC_JDATA13R_JDATA3_Msk     (0xFFFFU << SDADC_JDATA13R_JDATA3_Pos)   /*!< 0xFFFF0000 */
#define SDADC_JDATA13R_JDATA3         SDADC_JDATA13R_JDATA3_Msk                /*!< Injected group conversion data for SDADC3 */
#define SDADC_JDATA13R_JDATA1_Pos     (0U)                                     
#define SDADC_JDATA13R_JDATA1_Msk     (0xFFFFU << SDADC_JDATA13R_JDATA1_Pos)   /*!< 0x0000FFFF */
#define SDADC_JDATA13R_JDATA1         SDADC_JDATA13R_JDATA1_Msk                /*!< Injected group conversion data for SDADC1 */

/*****************  Bit definition for SDADC_RDATA13R register  ***************/
#define SDADC_RDATA13R_RDATA3_Pos     (16U)                                    
#define SDADC_RDATA13R_RDATA3_Msk     (0xFFFFU << SDADC_RDATA13R_RDATA3_Pos)   /*!< 0xFFFF0000 */
#define SDADC_RDATA13R_RDATA3         SDADC_RDATA13R_RDATA3_Msk                /*!< Regular conversion data for SDADC3 */
#define SDADC_RDATA13R_RDATA1_Pos     (0U)                                     
#define SDADC_RDATA13R_RDATA1_Msk     (0xFFFFU << SDADC_RDATA13R_RDATA1_Pos)   /*!< 0x0000FFFF */
#define SDADC_RDATA13R_RDATA1         SDADC_RDATA13R_RDATA1_Msk                /*!< Regular conversion data for SDADC1 */

/******************************************************************************/
/*                                                                            */
/*                        Serial Peripheral Interface (SPI)                   */
/*                                                                            */
/******************************************************************************/

