ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32F3xx/stm32f373xc.h
/* Aliases for __IRQn */
#define ADC1_2_IRQn             ADC1_IRQn
#define USB_LP_CAN_RX0_IRQn     CAN_RX0_IRQn
#define USB_HP_CAN_TX_IRQn      CAN_TX_IRQn
#define USBWakeUp_IRQn          CEC_IRQn
#define COMP1_2_IRQn            COMP_IRQn
#define COMP1_2_3_IRQn          COMP_IRQn
#define COMP2_IRQn              COMP_IRQn
#define ADC4_IRQn               SDADC1_IRQn
#define TIM8_BRK_IRQn           TIM12_IRQn
#define TIM8_UP_IRQn            TIM13_IRQn
#define TIM8_TRG_COM_IRQn       TIM14_IRQn
#define TIM1_BRK_TIM15_IRQn     TIM15_IRQn
#define TIM1_UP_TIM16_IRQn      TIM16_IRQn
#define TIM1_TRG_COM_TIM17_IRQn TIM17_IRQn
#define TIM1_CC_IRQn            TIM18_DAC2_IRQn
#define TIM20_UP_IRQn           TIM19_IRQn
#define TIM6_DAC_IRQn           TIM6_DAC1_IRQn
#define TIM7_DAC2_IRQn          TIM7_IRQn
#define USBWakeUp_RMP_IRQn      USBWakeUp_IRQn


/* Aliases for __IRQHandler */
#define ADC1_2_IRQHandler             ADC1_IRQHandler
#define USB_LP_CAN_RX0_IRQHandler     CAN_RX0_IRQHandler
#define USB_HP_CAN_TX_IRQHandler      CAN_TX_IRQHandler
#define USBWakeUp_IRQHandler          CEC_IRQHandler
#define COMP1_2_IRQHandler            COMP_IRQHandler
#define COMP1_2_3_IRQHandler          COMP_IRQHandler
#define COMP2_IRQHandler              COMP_IRQHandler
#define ADC4_IRQHandler               SDADC1_IRQHandler
#define TIM8_BRK_IRQHandler           TIM12_IRQHandler
#define TIM8_UP_IRQHandler            TIM13_IRQHandler
#define TIM8_TRG_COM_IRQHandler       TIM14_IRQHandler
#define TIM1_BRK_TIM15_IRQHandler     TIM15_IRQHandler
#define TIM1_UP_TIM16_IRQHandler      TIM16_IRQHandler
#define TIM1_TRG_COM_TIM17_IRQHandler TIM17_IRQHandler
#define TIM1_CC_IRQHandler            TIM18_DAC2_IRQHandler
#define TIM20_UP_IRQHandler           TIM19_IRQHandler
#define TIM6_DAC_IRQHandler           TIM6_DAC1_IRQHandler
#define TIM7_DAC2_IRQHandler          TIM7_IRQHandler
#define USBWakeUp_RMP_IRQHandler      USBWakeUp_IRQHandler


#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __STM32F373xC_H */

/**
  * @}
  */

  /**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
